In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt

In [10]:
file_path=r"C:\Python\python exp\Visadataset.csv"
pd.read_csv(file_path)
df=pd.read_csv(file_path)
df

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,EZYV01,Asia,High School,N,N,14513,2007,West,592.2029,Hour,Y,Denied
1,EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,83425.6500,Year,Y,Certified
2,EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122996.8600,Year,Y,Denied
3,EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434.0300,Year,Y,Denied
4,EZYV05,Africa,Master's,Y,N,1082,2005,South,149907.3900,Year,Y,Certified
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,77092.5700,Year,Y,Certified
25476,EZYV25477,Asia,High School,Y,N,3274,2006,Northeast,279174.7900,Year,Y,Certified
25477,EZYV25478,Asia,Master's,Y,N,1121,1910,South,146298.8500,Year,N,Certified
25478,EZYV25479,Asia,Master's,Y,Y,1918,1887,West,86154.7700,Year,Y,Certified
25479,EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwest,70876.9100,Year,Y,Certified

In [3]:
file_path=r"C:\Python\python exp\bank.csv"
pd.read_csv(file_path)

     age;"job";"marital";"education";"default";"balance";"housing";"loan";"contact";"day";"month";"duration";"campaign";"pdays";"previous";"poutcome";"y"
0     30;"unemployed";"married";"primary";"no";1787;...
1     33;"services";"married";"secondary";"no";4789;...
2     35;"management";"single";"tertiary";"no";1350;...
3     30;"management";"married";"tertiary";"no";1476...
4     59;"blue-collar";"married";"secondary";"no";0;...
...                                                 ...
4516  33;"services";"married";"secondary";"no";-333;...
4517  57;"self-employed";"married";"tertiary";"yes";...
4518  57;"technician";"married";"secondary";"no";295...
4519  28;"blue-collar";"married";"secondary";"no";11...
4520  44;"entrepreneur";"single";"tertiary";"no";113...

[4521 rows x 1 columns]

In [19]:
file_path2=r"C:\Python\python exp\bank.csv"
pd.read_csv(file_path,sep=";")
df2=pd.read_csv(file_path,sep=";")
df2

      case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0      EZYV01,Asia,High School,N,N,14513,2007,West,59...
1      EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8...
2      EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122...
3      EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434....
4      EZYV05,Africa,Master's,Y,N,1082,2005,South,149...
...                                                  ...
25475  EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,...
25476  EZYV25477,Asia,High School,Y,N,3274,2006,North...
25477  EZYV25478,Asia,Master's,Y,N,1121,1910,South,14...
25478  EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861...
25479  EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes...

[25480 rows x 1 columns]

In [ ]:
- shape
- size
- dtypes
- columns
- drop_duplicates
- isnull
- info

In [11]:
df.shape

(25480, 12)

In [20]:
df2.shape

(25480, 1)

In [12]:
df.size

305760

In [21]:
df2.size

25480

In [13]:
df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [22]:
df2.dtypes

case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status    object
dtype: object

In [14]:
df.columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'no_of_employees', 'yr_of_estab',
       'region_of_employment', 'prevailing_wage', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [23]:
df2.columns

Index(['case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status'], dtype='object')

In [15]:
df.drop_duplicates

<bound method DataFrame.drop_duplicates of          case_id continent education_of_employee has_job_experience  \
0         EZYV01      Asia           High School                  N
1         EZYV02      Asia              Master's                  Y
2         EZYV03      Asia            Bachelor's                  N
3         EZYV04      Asia            Bachelor's                  N
4         EZYV05    Africa              Master's                  Y
...          ...       ...                   ...                ...
25475  EZYV25476      Asia            Bachelor's                  Y
25476  EZYV25477      Asia           High School                  Y
25477  EZYV25478      Asia              Master's                  Y
25478  EZYV25479      Asia              Master's                  Y
25479  EZYV25480      Asia            Bachelor's                  Y

      requires_job_training  no_of_employees  yr_of_estab  \
0                         N            14513         2007
1                         N             2412         2002
2                         Y            44444         2008
3                         N               98         1897
4                         N             1082         2005
...                     ...              ...          ...
25475                     Y             2601         2008
25476                     N             3274         2006
25477                     N             1121         1910
25478                     Y             1918         1887
25479                     N             3195         1960

      region_of_employment  prevailing_wage unit_of_wage full_time_position  \
0                     West         592.2029         Hour                  Y
1                Northeast       83425.6500         Year                  Y
2                     West      122996.8600         Year                  Y
3                     West       83434.0300         Year                  Y
4                    South      149907.3900         Year                  Y
...                    ...              ...          ...                ...
25475                South       77092.5700         Year                  Y
25476            Northeast      279174.7900         Year                  Y
25477                South      146298.8500         Year                  N
25478                 West       86154.7700         Year                  Y
25479              Midwest       70876.9100         Year                  Y

      case_status
0          Denied
1       Certified
2          Denied
3          Denied
4       Certified
...           ...
25475   Certified
25476   Certified
25477   Certified
25478   Certified
25479   Certified

[25480 rows x 12 columns]>

In [24]:
df2.drop_duplicates

<bound method DataFrame.drop_duplicates of       case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0      EZYV01,Asia,High School,N,N,14513,2007,West,59...
1      EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8...
2      EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122...
3      EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434....
4      EZYV05,Africa,Master's,Y,N,1082,2005,South,149...
...                                                  ...
25475  EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,...
25476  EZYV25477,Asia,High School,Y,N,3274,2006,North...
25477  EZYV25478,Asia,Master's,Y,N,1121,1910,South,14...
25478  EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861...
25479  EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes...

[25480 rows x 1 columns]>

In [16]:
df.isnull

<bound method DataFrame.isnull of          case_id continent education_of_employee has_job_experience  \
0         EZYV01      Asia           High School                  N
1         EZYV02      Asia              Master's                  Y
2         EZYV03      Asia            Bachelor's                  N
3         EZYV04      Asia            Bachelor's                  N
4         EZYV05    Africa              Master's                  Y
...          ...       ...                   ...                ...
25475  EZYV25476      Asia            Bachelor's                  Y
25476  EZYV25477      Asia           High School                  Y
25477  EZYV25478      Asia              Master's                  Y
25478  EZYV25479      Asia              Master's                  Y
25479  EZYV25480      Asia            Bachelor's                  Y

      requires_job_training  no_of_employees  yr_of_estab  \
0                         N            14513         2007
1                         N             2412         2002
2                         Y            44444         2008
3                         N               98         1897
4                         N             1082         2005
...                     ...              ...          ...
25475                     Y             2601         2008
25476                     N             3274         2006
25477                     N             1121         1910
25478                     Y             1918         1887
25479                     N             3195         1960

      region_of_employment  prevailing_wage unit_of_wage full_time_position  \
0                     West         592.2029         Hour                  Y
1                Northeast       83425.6500         Year                  Y
2                     West      122996.8600         Year                  Y
3                     West       83434.0300         Year                  Y
4                    South      149907.3900         Year                  Y
...                    ...              ...          ...                ...
25475                South       77092.5700         Year                  Y
25476            Northeast      279174.7900         Year                  Y
25477                South      146298.8500         Year                  N
25478                 West       86154.7700         Year                  Y
25479              Midwest       70876.9100         Year                  Y

      case_status
0          Denied
1       Certified
2          Denied
3          Denied
4       Certified
...           ...
25475   Certified
25476   Certified
25477   Certified
25478   Certified
25479   Certified

[25480 rows x 12 columns]>

In [25]:
df2.isnull

<bound method DataFrame.isnull of       case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0      EZYV01,Asia,High School,N,N,14513,2007,West,59...
1      EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8...
2      EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122...
3      EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434....
4      EZYV05,Africa,Master's,Y,N,1082,2005,South,149...
...                                                  ...
25475  EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,...
25476  EZYV25477,Asia,High School,Y,N,3274,2006,North...
25477  EZYV25478,Asia,Master's,Y,N,1121,1910,South,14...
25478  EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861...
25479  EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes...

[25480 rows x 1 columns]>

In [17]:
df.info

<bound method DataFrame.info of          case_id continent education_of_employee has_job_experience  \
0         EZYV01      Asia           High School                  N
1         EZYV02      Asia              Master's                  Y
2         EZYV03      Asia            Bachelor's                  N
3         EZYV04      Asia            Bachelor's                  N
4         EZYV05    Africa              Master's                  Y
...          ...       ...                   ...                ...
25475  EZYV25476      Asia            Bachelor's                  Y
25476  EZYV25477      Asia           High School                  Y
25477  EZYV25478      Asia              Master's                  Y
25478  EZYV25479      Asia              Master's                  Y
25479  EZYV25480      Asia            Bachelor's                  Y

      requires_job_training  no_of_employees  yr_of_estab  \
0                         N            14513         2007
1                         N             2412         2002
2                         Y            44444         2008
3                         N               98         1897
4                         N             1082         2005
...                     ...              ...          ...
25475                     Y             2601         2008
25476                     N             3274         2006
25477                     N             1121         1910
25478                     Y             1918         1887
25479                     N             3195         1960

      region_of_employment  prevailing_wage unit_of_wage full_time_position  \
0                     West         592.2029         Hour                  Y
1                Northeast       83425.6500         Year                  Y
2                     West      122996.8600         Year                  Y
3                     West       83434.0300         Year                  Y
4                    South      149907.3900         Year                  Y
...                    ...              ...          ...                ...
25475                South       77092.5700         Year                  Y
25476            Northeast      279174.7900         Year                  Y
25477                South      146298.8500         Year                  N
25478                 West       86154.7700         Year                  Y
25479              Midwest       70876.9100         Year                  Y

      case_status
0          Denied
1       Certified
2          Denied
3          Denied
4       Certified
...           ...
25475   Certified
25476   Certified
25477   Certified
25478   Certified
25479   Certified

[25480 rows x 12 columns]>

In [26]:
df2.info

<bound method DataFrame.info of       case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0      EZYV01,Asia,High School,N,N,14513,2007,West,59...
1      EZYV02,Asia,Master's,Y,N,2412,2002,Northeast,8...
2      EZYV03,Asia,Bachelor's,N,Y,44444,2008,West,122...
3      EZYV04,Asia,Bachelor's,N,N,98,1897,West,83434....
4      EZYV05,Africa,Master's,Y,N,1082,2005,South,149...
...                                                  ...
25475  EZYV25476,Asia,Bachelor's,Y,Y,2601,2008,South,...
25476  EZYV25477,Asia,High School,Y,N,3274,2006,North...
25477  EZYV25478,Asia,Master's,Y,N,1121,1910,South,14...
25478  EZYV25479,Asia,Master's,Y,Y,1918,1887,West,861...
25479  EZYV25480,Asia,Bachelor's,Y,N,3195,1960,Midwes...

[25480 rows x 1 columns]>

In [27]:
df.columns.index('case_status')

AttributeError: 'Index' object has no attribute 'index'

In [29]:
df.columns.to_list()

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [28]:
list(df)

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [31]:
df.isnull()

,case_id,continent,education_of_employee,has_job_experience,requires_job_training,no_of_employees,yr_of_estab,region_of_employment,prevailing_wage,unit_of_wage,full_time_position,case_status
0,False,False,False,False,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...,...,...,...,...
25475,False,False,False,False,False,False,False,False,False,False,False,False
25476,False,False,False,False,False,False,False,False,False,False,False,False
25477,False,False,False,False,False,False,False,False,False,False,False,False
25478,False,False,False,False,False,False,False,False,False,False,False,False
25479,False,False,False,False,False,False,False,False,False,False,False,False

In [34]:
df.isnull().sum()

case_id                  0
continent                0
education_of_employee    0
has_job_experience       0
requires_job_training    0
no_of_employees          0
yr_of_estab              0
region_of_employment     0
prevailing_wage          0
unit_of_wage             0
full_time_position       0
case_status              0
dtype: int64

In [37]:
df.drop_duplicates().sum()

case_id                  EZYV01EZYV02EZYV03EZYV04EZYV05EZYV06EZYV07EZYV...
continent                AsiaAsiaAsiaAsiaAfricaAsiaAsiaNorth AmericaAsi...
education_of_employee    High SchoolMaster'sBachelor'sBachelor'sMaster'...
has_job_experience       NYNNYYNYNYNYYYYYYYYNNYYNYNYYYYYYNNNYYYYNYYYYYN...
requires_job_training    NNYNNNNNNNNNNNYNNNNNNNNNNNNYNNNNNNNNNYYNNNNNNY...
no_of_employees                                                  144396261
yr_of_estab                                                       50435365
region_of_employment     WestNortheastWestWestSouthSouthSouthWestMidwes...
prevailing_wage                                            1897134155.8065
unit_of_wage             HourYearYearYearYearYearYearHourYearYearYearYe...
full_time_position       YYYYYYYYYYYYYYYYYYYYYNYNYYYYYYNNNYNYYYYYYNYYYY...
case_status              DeniedCertifiedDeniedDeniedCertifiedCertifiedC...
dtype: object

In [39]:
df1=df.copy()

In [40]:
df1.shape,df.shape

((25480, 12), (25480, 12))

In [41]:
df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [42]:
type(df.dtypes)

pandas.core.series.Series

- Series is a key-value pair.
- Series can form a dictionary, when we type cast into dict.
- Series can also easily convert into dataframe.

In [49]:
visa=pd.DataFrame(df.dtypes, columns=['Type'])
visa
# TASK : How to make Index as a column

                          Type
case_id                 object
continent               object
education_of_employee   object
has_job_experience      object
requires_job_training   object
no_of_employees          int64
yr_of_estab              int64
region_of_employment    object
prevailing_wage        float64
unit_of_wage            object
full_time_position      object
case_status             object

In [59]:
visa=pd.DataFrame(df.dtypes,columns=['Type'])
visa.reset_index(inplace=True)
visa.rename(columns={'index':'Columns'},inplace=True)
visa

                  Columns     Type
0                 case_id   object
1               continent   object
2   education_of_employee   object
3      has_job_experience   object
4   requires_job_training   object
5         no_of_employees    int64
6             yr_of_estab    int64
7    region_of_employment   object
8         prevailing_wage  float64
9            unit_of_wage   object
10     full_time_position   object
11            case_status   object

In [61]:
df.dtypes

case_id                   object
continent                 object
education_of_employee     object
has_job_experience        object
requires_job_training     object
no_of_employees            int64
yr_of_estab                int64
region_of_employment      object
prevailing_wage          float64
unit_of_wage              object
full_time_position        object
case_status               object
dtype: object

In [62]:
df.dtypes.to_dict()

{'case_id': dtype('O'),
 'continent': dtype('O'),
 'education_of_employee': dtype('O'),
 'has_job_experience': dtype('O'),
 'requires_job_training': dtype('O'),
 'no_of_employees': dtype('int64'),
 'yr_of_estab': dtype('int64'),
 'region_of_employment': dtype('O'),
 'prevailing_wage': dtype('float64'),
 'unit_of_wage': dtype('O'),
 'full_time_position': dtype('O'),
 'case_status': dtype('O')}

In [63]:
df.dtypes.to_dict().keys()

dict_keys(['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'no_of_employees', 'yr_of_estab', 'region_of_employment', 'prevailing_wage', 'unit_of_wage', 'full_time_position', 'case_status'])

In [65]:
list(df.dtypes.to_dict().keys())

['case_id',
 'continent',
 'education_of_employee',
 'has_job_experience',
 'requires_job_training',
 'no_of_employees',
 'yr_of_estab',
 'region_of_employment',
 'prevailing_wage',
 'unit_of_wage',
 'full_time_position',
 'case_status']

In [66]:
df.dtypes.to_dict().values()

dict_values([dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('O'), dtype('int64'), dtype('int64'), dtype('O'), dtype('float64'), dtype('O'), dtype('O'), dtype('O')])

In [67]:
list(df.dtypes.to_dict().values())

[dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('O'),
 dtype('int64'),
 dtype('int64'),
 dtype('O'),
 dtype('float64'),
 dtype('O'),
 dtype('O'),
 dtype('O')]

**Task-2**
- Extract categorical columns and numerical columns in separate list.

In [69]:
l=['apple','Ball','cat','Dog']
l2=[object,int,object,int]

In [72]:
types=df.dtypes.to_dict().values()
cols=df.dtypes.to_dict().keys()
for i in types:
    print(i)

object
object
object
object
object
int64
int64
object
float64
object
object
object

In [76]:
for i,j in df.dtypes.to_dict().items():
    if j=='object':
        print(i,j)

case_id object
continent object
education_of_employee object
has_job_experience object
requires_job_training object
region_of_employment object
unit_of_wage object
full_time_position object
case_status object

In [87]:
cat=[]
num=[]
data_types=df.dtypes.to_dict().items()
for i,j in df.dtypes.to_dict().items():
    if j=='object':
        cat.append(i)
    else:
        num.append(i)
print(cat)
print(num)

['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']
['no_of_employees', 'yr_of_estab', 'prevailing_wage']

In [88]:
data_types=df.dtypes.to_dict().items()
cat=[i for i,j in data_types if j=='object']
num=[i for i,j in data_types if j!='object']
print(cat)
print(num)

['case_id', 'continent', 'education_of_employee', 'has_job_experience', 'requires_job_training', 'region_of_employment', 'unit_of_wage', 'full_time_position', 'case_status']
['no_of_employees', 'yr_of_estab', 'prevailing_wage']

**select_dtypes**

In [85]:
df.select_dtypes(include='object').columns

Index(['case_id', 'continent', 'education_of_employee', 'has_job_experience',
       'requires_job_training', 'region_of_employment', 'unit_of_wage',
       'full_time_position', 'case_status'],
      dtype='object')

In [86]:
df.select_dtypes(exclude='object').columns

Index(['no_of_employees', 'yr_of_estab', 'prevailing_wage'], dtype='object')